W8D1/reddit_clone/app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @post = Post.find_by(id: params[:id])
        @sub = Sub.find_by(id: @post.sub_id)
        @author = User.find_by(id: @post.author_id)

INSERT INTO "posts" ("subject", "url", "content", "sub_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["subject", "bobodog"], ["url", ""], ["content", ""], ["sub_id", 3], ["author_id", 1], ["created_at", "2019-12-03 00:47:50.753693"], ["updated_at", "2019-12-03 00:47:50.753693"]]
---
    def create
        @post = Post.new(post_params)
        @post.author_id = current_user.id
        if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "posts" SET "content" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["content", "meows a lot?"], ["updated_at", "2019-12-03 00:57:09.984834"], ["id", 3]]
---
    def update
        @post = Post.find_by(id: params[:id])
        if @post.author_id != current_user.id
            flash.now[:errors] = ['You cannot edit someone else''s post.']
            render :edit
        else
            if @post.update(post_params)