W8D1/reddit_clone/app/controllers/subs_controller.rb

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."sub_id" = $1 LIMIT $2  [["sub_id", 3], ["LIMIT", 1]]
---
    def show
        @sub = Sub.find_by(id: params[:id])
        @moderator = User.find_by(id: @sub.user_id)
        @posts = Post.where(sub_id: @sub.id)

INSERT INTO "subs" ("description", "user_id", "created_at", "updated_at", "title") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "gift ideas"], ["user_id", 1], ["created_at", "2019-12-03 07:08:55.973783"], ["updated_at", "2019-12-03 07:08:55.973783"], ["title", "christmas"]]
---
    def create
        @sub = Sub.new(sub_params)
        @sub.user_id = current_user.id
        if @sub.save

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "lots of meows"], ["updated_at", "2019-12-02 21:44:57.249617"], ["id", 1]]
---
    def update
        @sub = Sub.find_by(id: params[:id])
        if @sub.user_id != current_user.id
            flash.now[:errors] = ['Permission Denied']
            render :edit
        else
            if @sub.update(sub_params)