W10D5/Todos2/Todos/app/controllers/api/todos_controller.rb

  def index
    todos = Todo.all
---
SELECT "todos".* FROM "todos"

  def create
    todo = Todo.new(todo_params)
    if todo.save
---
INSERT INTO "todos" ("title", "body", "done", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "asdasd"], ["body", "asdasdasd"], ["done", false], ["created_at", "2019-12-20 22:28:16.922133"], ["updated_at", "2019-12-20 22:28:16.922133"]]