W6D5/cats_99/app/controllers/cats_controller.rb

  def create
    @cat = Cat.new(cat_params)
    if @cat.save
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["birth_date", "2017-10-22"], ["color", "grey"], ["name", "Rosemary"], ["sex", "F"], ["created_at", "2019-11-22 23:36:19.174875"], ["updated_at", "2019-11-22 23:36:19.174875"]]

  def update
    @cat = Cat.find_by(id: params[:id])
    if @cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "cats" SET "birth_date" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["birth_date", "2019-11-22"], ["description", " still a girl"], ["updated_at", "2019-11-23 00:12:21.564048"], ["id", 6]]